backend/controllers/CoursesController.php

    protected function findModel($id)
    {
        if (($model = Courses::findOne($id)) !== null) {
---
SELECT * FROM `courses` WHERE `id`='1'