backend/controllers/UsersController.php

    public function actionPayment($action, $id, $days)
    {
        if (Yii::$app->request->isAjax) {
            Yii::$app->response->format = Response::FORMAT_JSON;
            $modelPayment = Payment::find()->where(['id' => $id])->one();
            $modelUser = User::find()->where(['id' => $modelPayment->created_by])->one();
---
SELECT * FROM `user` WHERE `id`=11