frontend/controllers/SiteController.php

SELECT * FROM `user` WHERE `id`=9
---
    public function actionIndex()
    {
        if (Yii::$app->user->isGuest) {
            $this->layout = 'landing';
            return $this->render('/site/landing');
        } else {


            $id = Yii::$app->getUser()->getId();
            $model = User::find()->where(['id' => $id])->one();