common/models/Payment.php

    public function save($runValidation = false, $attributeNames = null)
    {
        $userModel = User::findOne(['id' => Yii::$app->user->id]);
        $userID = Yii::$app->user->identity->id;
        $imagePath = 'uploads/' . $userID . '/' . time() . '.jpg';
        $isInsert = $this->isNewRecord;
        if ($isInsert) {
            $this->img = $imagePath;
            $userModel->updateAttributes(['status' => 1]);
        }
        $saved = parent::save($runValidation, $attributeNames);
        if (!$saved) {
            return false;
        }
        if ($isInsert) {
            $imgPath = Yii::getAlias('@frontend/web/' . $imagePath);
            if (!is_dir(dirname($imgPath))) {
                FileHelper::createDirectory(dirname($imgPath));
            }
            $this->image->saveAs($imgPath);
---
SELECT * FROM `user` WHERE `id`=9
UPDATE `payment` SET `status`=2, `updated_at`=1595890790 WHERE `id`=17