common/models/User.php

SELECT * FROM `user` WHERE `phone`='991234567'
---
    public static function findByPhone($phone)
    {
        return static::findOne(['phone' => $phone, 'status' => self::STATUS_ACTIVE]);