backend/models/DashboardStat.php

SELECT COUNT(*) FROM `user` WHERE `status`=0
SELECT COUNT(*) FROM `user` WHERE `status`=1
SELECT COUNT(*) FROM `user` WHERE `status`=2
---
    public function countUsers()
    {
        $this->registeredUsers = User::find()
            ->andWhere(['status' => 0])
            ->count();
        $this->waitingUsers = User::find()
            ->andWhere(['status' => 1])
            ->count();
        $this->activeUsers = User::find()
            ->andWhere(['status' => 2])
            ->count();